{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "input_14", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "name": "input_14"}, "inbound_nodes": []}, {"name": "conv1d_13", "class_name": "Conv1D", "config": {"name": "conv1d_13", "trainable": true, "filters": 128, "kernel_size": [50], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_13", 0, 0, {}]], [["input_14", 0, 0, {}]]]}, {"name": "conv1d_14", "class_name": "Conv1D", "config": {"name": "conv1d_14", "trainable": true, "filters": 64, "kernel_size": [50], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_13", 0, 0, {}]], [["conv1d_13", 1, 0, {}]]]}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv1d_14", 0, 0, {}], ["conv1d_14", 1, 0, {}]]]}, {"name": "flatten_7", "class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"name": "dropout_13", "class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_7", 0, 0, {}]]]}, {"name": "dense_13", "class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"name": "dropout_14", "class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"name": "dense_14", "class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}], "input_layers": [["input_13", 0, 0], ["input_14", 0, 0]], "output_layers": [["dense_14", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}